Revit 2027 API
RebarBendData.HookAngle1 Property
 The angle (in degrees) of the hook at the end. Must be at least 0 and no more than 180. If the value is 0 it means that there is no hook. The default value is 0. When setting from 0 to another value all crank lengths for end will be set to 0. When setting this value to 0 HookLength1 will be set to 0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int HookAngle1 { get; set; }
Public Property HookAngle1 As Integer
	Get
	Set
public:
property int HookAngle1 {
	int get ();
	void set (int value);
}
member HookAngle1 : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: hookAngle1 must be at least 0 and no more than 180.
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace